/*
Зробив завдання, як я прочитав в гуглі то шрифт цезаря це зсув на 3 літери вправо.
Зробив і для маленьких і для великих літер і передбачив останні літри x y z що
вони з початку починались
*/

#include <stdio.h>

int main(){

    char a, b, c;
    printf("Enter 3 digits\n");
    scanf("%c %c %c", &a, &b, &c);
    //для а
    if(a == 'x' || a == 'y' || a == 'z' || a == 'X' || a == 'Y' || a == 'Z'){
        a -= 26; //кільцість букв в алфіавіті
    }
    a += 3;
    //ДЛЯ b
    if(b == 'x' || b == 'y' || b == 'z' || b == 'X' || b == 'Y' || b == 'Z'){
        b -= 26;
    }
    b += 3;
    //для c
    if(c == 'x' || c == 'y' || c == 'z' || c == 'X' || c == 'Y' || c == 'Z'){
        c -= 26;
    }
    c += 3;

    printf("Rezult: \n");
    printf("%c %c %c",a, b, c);

    return 0;
}